<a href="https://colab.research.google.com/github/neethj/virtual-internship/blob/main/KPMG_TASK1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [2]:
from google.colab import drive
drive.mount('/content/drive/')

Mounted at /content/drive/

In [3]:
df = pd.read_excel("/content/drive/MyDrive/kaggle/kpmg.xlsx",sheet_name="Transactions")

In [4]:
df

       transaction_id  product_id  ...  standard_cost product_first_sold_date
0                   1           2  ...          53.62                 41245.0
1                   2           3  ...         388.92                 41701.0
2                   3          37  ...         248.82                 36361.0
3                   4          88  ...         381.10                 36145.0
4                   5          78  ...         709.48                 42226.0
...               ...         ...  ...            ...                     ...
19995           19996          51  ...        1203.40                 37823.0
19996           19997          41  ...         312.74                 35560.0
19997           19998          87  ...          44.71                 40410.0
19998           19999           6  ...         136.73                 38216.0
19999           20000          11  ...        1580.47                 36334.0

[20000 rows x 13 columns]

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20000 entries, 0 to 19999
Data columns (total 13 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   transaction_id           20000 non-null  int64
 1   product_id               20000 non-null  int64
 2   customer_id              20000 non-null  int64
 3   transaction_date         20000 non-null  datetime64[ns]
 4   online_order             19640 non-null  float64
 5   order_status             20000 non-null  object
 6   brand                    19803 non-null  object
 7   product_line             19803 non-null  object
 8   product_class            19803 non-null  object
 9   product_size             19803 non-null  object
 10  list_price               20000 non-null  float64
 11  standard_cost            19803 non-null  float64
 12  product_first_sold_date  19803 non-null  float64
dtypes: datetime64[ns](1), float64(4), int64(3), object(5)
memory usage: 2.0+ MB

In [6]:
# converting the float to datetime format 
df['product_first_sold_date'] = pd.to_datetime(df['product_first_sold_date']).dt.date

In [7]:
df.head()

   transaction_id  product_id  ...  standard_cost product_first_sold_date
0               1           2  ...          53.62              1970-01-01
1               2           3  ...         388.92              1970-01-01
2               3          37  ...         248.82              1970-01-01
3               4          88  ...         381.10              1970-01-01
4               5          78  ...         709.48              1970-01-01

[5 rows x 13 columns]

In [8]:
df.isnull().sum()

transaction_id               0
product_id                   0
customer_id                  0
transaction_date             0
online_order               360
order_status                 0
brand                      197
product_line               197
product_class              197
product_size               197
list_price                   0
standard_cost              197
product_first_sold_date    197
dtype: int64

In [9]:
df["online_order"].value_counts()

1.0    9829
0.0    9811
Name: online_order, dtype: int64

In [10]:
df["brand"].value_counts()

Solex             4253
Giant Bicycles    3312
WeareA2B          3295
OHM Cycles        3043
Trek Bicycles     2990
Norco Bicycles    2910
Name: brand, dtype: int64

In [11]:
# occurrence based on all columns
duplicate = df[df.duplicated()]
df[duplicate].sum()

transaction_id             0.0
product_id                 0.0
customer_id                0.0
online_order               0.0
order_status               0.0
brand                      0.0
product_line               0.0
product_class              0.0
product_size               0.0
list_price                 0.0
standard_cost              0.0
product_first_sold_date    0.0
dtype: float64

In [12]:
df1 = pd.read_excel("/content/drive/MyDrive/kaggle/kpmg.xlsx",sheet_name="NewCustomerList")

In [13]:
df1.head()

  first_name  last_name  gender  ...  Unnamed: 20 Rank     Value
0    Chickie    Brister    Male  ...            1    1  1.718750
1      Morly     Genery    Male  ...            1    1  1.718750
2    Ardelis  Forrester  Female  ...            1    1  1.718750
3     Lucine      Stutt  Female  ...            4    4  1.703125
4    Melinda     Hadlee  Female  ...            4    4  1.703125

[5 rows x 23 columns]

In [14]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 23 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   first_name                           1000 non-null   object
 1   last_name                            971 non-null    object
 2   gender                               1000 non-null   object
 3   past_3_years_bike_related_purchases  1000 non-null   int64
 4   DOB                                  983 non-null    datetime64[ns]
 5   job_title                            894 non-null    object
 6   job_industry_category                835 non-null    object
 7   wealth_segment                       1000 non-null   object
 8   deceased_indicator                   1000 non-null   object
 9   owns_car                             1000 non-null   object
 10  tenure                               1000 non-null   int64
 11  address                              1000 non-null   object
 12  postcode                             1000 non-null   int64
 13  state                                1000 non-null   object
 14  country                              1000 non-null   object
 15  property_valuation                   1000 non-null   int64
 16  Unnamed: 16                          1000 non-null   float64
 17  Unnamed: 17                          1000 non-null   float64
 18  Unnamed: 18                          1000 non-null   float64
 19  Unnamed: 19                          1000 non-null   float64
 20  Unnamed: 20                          1000 non-null   int64
 21  Rank                                 1000 non-null   int64
 22  Value                                1000 non-null   float64
dtypes: datetime64[ns](1), float64(5), int64(6), object(11)
memory usage: 179.8+ KB

In [15]:
cols = ['Unnamed: 16','Unnamed: 17','Unnamed: 18','Unnamed: 19','Unnamed: 20']

In [16]:
df1.drop(cols, axis=1,inplace = True)

In [17]:
df1.head()

  first_name  last_name  gender  ...  property_valuation Rank     Value
0    Chickie    Brister    Male  ...                   6    1  1.718750
1      Morly     Genery    Male  ...                  11    1  1.718750
2    Ardelis  Forrester  Female  ...                   5    1  1.718750
3     Lucine      Stutt  Female  ...                   1    4  1.703125
4    Melinda     Hadlee  Female  ...                   9    4  1.703125

[5 rows x 18 columns]

In [18]:
df1.isnull().sum()

first_name                               0
last_name                               29
gender                                   0
past_3_years_bike_related_purchases      0
DOB                                     17
job_title                              106
job_industry_category                  165
wealth_segment                           0
deceased_indicator                       0
owns_car                                 0
tenure                                   0
address                                  0
postcode                                 0
state                                    0
country                                  0
property_valuation                       0
Rank                                     0
Value                                    0
dtype: int64

In [19]:
df1.duplicated().sum()

0

In [20]:
df1["gender"].value_counts()

Female    513
Male      470
U          17
Name: gender, dtype: int64

In [21]:
df1=df1.replace(to_replace =["U"], value ="Unspecified")

In [22]:
df1["gender"].value_counts()

Female         513
Male           470
Unspecified     17
Name: gender, dtype: int64

In [23]:
df2 = pd.read_excel("/content/drive/MyDrive/kaggle/kpmg.xlsx",sheet_name="CustomerDemographic")

In [24]:
df2.head()

   customer_id      first_name  ... owns_car tenure
0            1         Laraine  ...      Yes   11.0
1            2             Eli  ...      Yes   16.0
2            3           Arlin  ...      Yes   15.0
3            4          Talbot  ...       No    7.0
4            5  Sheila-kathryn  ...      Yes    8.0

[5 rows x 13 columns]

In [35]:
df2["DOB"].value_counts()

1978-01-30    7
1977-05-13    4
1976-07-16    4
1978-08-19    4
1976-09-25    4
             ..
1974-06-16    1
1969-11-21    1
1961-11-24    1
1995-05-03    1
1972-04-14    1
Name: DOB, Length: 3448, dtype: int64

In [36]:
df2["DOB"].isnull().sum()

87

In [37]:
df2.isnull().sum()

customer_id                              0
first_name                               0
last_name                              125
gender                                   0
past_3_years_bike_related_purchases      0
DOB                                     87
job_title                              506
job_industry_category                  656
wealth_segment                           0
deceased_indicator                       0
owns_car                                 0
tenure                                  87
dtype: int64

In [25]:
df2 = df2.drop('default',axis=1)

In [26]:
df2["gender"].value_counts()

Female    2037
Male      1872
U           88
Femal        1
F            1
M            1
Name: gender, dtype: int64

In [27]:
df2["gender"]=df2["gender"].replace('F','Female').replace('Femal','Female').replace('M','Male').replace('U','Unspecified')

In [28]:
df2["gender"].value_counts()

Female         2039
Male           1873
Unspecified      88
Name: gender, dtype: int64

In [29]:
df3 = pd.read_excel("/content/drive/MyDrive/kaggle/kpmg.xlsx",sheet_name="CustomerAddress")

In [30]:
df3.head()

   customer_id              address  ...    country property_valuation
0            1   060 Morning Avenue  ...  Australia                 10
1            2  6 Meadow Vale Court  ...  Australia                 10
2            4   0 Holy Cross Court  ...  Australia                  9
3            5  17979 Del Mar Point  ...  Australia                  4
4            6     9 Oakridge Court  ...  Australia                  9

[5 rows x 6 columns]

In [38]:
df3.isnull().sum()

customer_id           0
address               0
postcode              0
state                 0
country               0
property_valuation    0
dtype: int64

In [31]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3999 entries, 0 to 3998
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   customer_id         3999 non-null   int64
 1   address             3999 non-null   object
 2   postcode            3999 non-null   int64
 3   state               3999 non-null   object
 4   country             3999 non-null   object
 5   property_valuation  3999 non-null   int64
dtypes: int64(3), object(3)
memory usage: 187.6+ KB

In [32]:
df3["state"].value_counts()

NSW                2054
VIC                 939
QLD                 838
New South Wales      86
Victoria             82
Name: state, dtype: int64

In [33]:
df3["state"] = df3["state"].replace("New South Wales","NSW").replace("Victoria","VIC")

In [34]:
df3["state"].value_counts()

NSW    2140
VIC    1021
QLD     838
Name: state, dtype: int64